-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2025 年 7 月 21 日 09:02
-- サーバのバージョン： 10.4.28-MariaDB
-- PHP のバージョン: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `gs_db_leveltest3`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `gs_leveltest3_01`
--

CREATE TABLE `gs_leveltest3_01` (
  `id` int(11) NOT NULL,
  `date` date DEFAULT NULL,
  `name` varchar(128) DEFAULT NULL,
  `school` varchar(15) DEFAULT NULL,
  `year` varchar(8) DEFAULT NULL,
  `class` varchar(8) DEFAULT NULL,
  `gender` varchar(8) DEFAULT NULL,
  `language` varchar(50) DEFAULT NULL,
  `q0_1_1` int(11) DEFAULT NULL,
  `q0_1_2` int(11) DEFAULT NULL,
  `q0_1_3` int(11) DEFAULT NULL,
  `q0_1_4` int(11) DEFAULT NULL,
  `q0_1_5` int(11) DEFAULT NULL,
  `q0_1_6` int(11) DEFAULT NULL,
  `q0_1_7` int(11) DEFAULT NULL,
  `q0_1_score` int(11) DEFAULT NULL,
  `q0_2_1` int(11) DEFAULT NULL,
  `q0_2_2` int(11) DEFAULT NULL,
  `q0_2_3` int(11) DEFAULT NULL,
  `q0_2_4` int(11) DEFAULT NULL,
  `q0_2_5` int(11) DEFAULT NULL,
  `q0_2_6` int(11) DEFAULT NULL,
  `q0_2_7` int(11) DEFAULT NULL,
  `q0_2_8` int(11) DEFAULT NULL,
  `q0_2_9` int(11) DEFAULT NULL,
  `q0_2_10` int(11) DEFAULT NULL,
  `q0_2_score` int(11) DEFAULT NULL,
  `q0_3_1` int(11) DEFAULT NULL,
  `q0_3_2` int(11) DEFAULT NULL,
  `q0_3_3` int(11) DEFAULT NULL,
  `q0_3_score` int(11) DEFAULT NULL,
  `hiragana_score` int(11) DEFAULT NULL,
  `katakana_score` int(11) DEFAULT NULL,
  `q0_4_score` int(11) DEFAULT NULL,
  `total_score` int(11) DEFAULT NULL,
  `submitted_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `unselected_hiragana` text DEFAULT NULL,
  `unselected_katakana` text DEFAULT NULL,
  `selected_hiragana` text DEFAULT NULL,
  `selected_katakana` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `gs_leveltest3_01`
--

INSERT INTO `gs_leveltest3_01` (`id`, `date`, `name`, `school`, `year`, `class`, `gender`, `language`, `q0_1_1`, `q0_1_2`, `q0_1_3`, `q0_1_4`, `q0_1_5`, `q0_1_6`, `q0_1_7`, `q0_1_score`, `q0_2_1`, `q0_2_2`, `q0_2_3`, `q0_2_4`, `q0_2_5`, `q0_2_6`, `q0_2_7`, `q0_2_8`, `q0_2_9`, `q0_2_10`, `q0_2_score`, `q0_3_1`, `q0_3_2`, `q0_3_3`, `q0_3_score`, `hiragana_score`, `katakana_score`, `q0_4_score`, `total_score`, `submitted_at`, `unselected_hiragana`, `unselected_katakana`, `selected_hiragana`, `selected_katakana`) VALUES
(1, '2025-07-02', 'Akemi Chikaoka', 'OOO幼稚園', '1', '2', '女性', 'zh', 5, 5, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 0, 0, 2, 2, 2, 0, 5, 5, 0, 0, 5, 1, 0, 0, '2025-07-02 09:49:12', NULL, NULL, NULL, NULL),
(3, '2025-07-03', 'ほしのたいが', 'CEC学園', '３', '４', '男性', 'ja', 5, 5, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 5, 3, 0, 0, '2025-07-03 07:20:53', NULL, NULL, NULL, NULL),
(4, '2025-06-29', 'Akemi Chikaoka', 'GS小学校', '1', '2', '女性', 'vi', 0, 5, 0, 5, 0, 0, 0, 10, 0, 0, 0, 2, 2, 0, 0, 0, 0, 0, 4, 5, 0, 0, 5, 7, 4, 11, 30, '2025-07-03 10:38:34', 'う, お,き, け, さ, そ', NULL, 'ち, て, ぬ, ね, は, ふ, み, む, め, や, よ, ら, れ, ん', ''),
(5, '2025-07-03', 'ちかおか　あけみ', 'GGGSSSschool', '1', '2', '女性', 'ja', 5, 5, 0, 0, 0, 0, 0, 10, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 12, 5, 5, 0, 10, 0, 0, 0, 32, '2025-07-03 10:46:46', '', '', '', ''),
(8, '2025-06-19', 'Qazwsxe Rfvtg', 'CEC学園', '1', '2', '男子', 'uz', 5, 5, 0, 0, 5, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0, 0, 0, 0, 0, '2025-07-03 11:22:43', NULL, NULL, NULL, NULL),
(10, '2025-06-05', 'yugu tiroeo', 'OOO幼稚園', '年中', 'さくら', '女子', 'tl', 5, 5, 0, 0, 0, 0, 0, 10, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 6, 5, 5, 5, 15, 0, 0, 0, 31, '2025-07-03 11:32:45', NULL, NULL, NULL, NULL),
(11, '2025-06-01', 'asedfgh hggfd', 'CDWQ SCHULE', '1', '3', '女性', 'uz', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 5, 15, 20, 10, 30, 100, '2025-07-03 11:34:24', NULL, NULL, NULL, NULL),
(12, '2025-06-24', 'qwer yuiop', 'ABC ES', '1', '2', '女子', 'vi', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 18, 5, 5, 5, 15, 0, 0, 0, 68, '2025-07-03 11:47:26', NULL, NULL, NULL, NULL),
(13, '2025-05-31', 'ちかおか　あけみ', 'GS小学校', '1', '3', '女性', 'ne', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 18, 5, 5, 5, 15, 0, 0, 0, 68, '2025-07-03 12:03:36', NULL, NULL, NULL, NULL),
(14, '2025-06-03', 'resasg　rieskoda', 'ABC JS', '1', 'D', '女性', 'uz', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 5, 15, 0, 0, 0, 70, '2025-07-04 00:16:31', NULL, NULL, NULL, NULL),
(15, '2025-05-01', 'qwertyu tyuiop', 'GS小学校', '1', '3', '男性', 'zh', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 5, 15, 0, 0, 0, 70, '2025-07-04 00:36:59', NULL, NULL, NULL, NULL),
(16, '2025-05-14', 'ちかおか　あけみ', 'GSschool', '6', 'さくら', '女子', 'mn', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 5, 15, 20, 10, 0, 100, '2025-07-04 00:46:11', NULL, NULL, NULL, NULL),
(17, '2025-05-21', 'さいさい　とうとう', 'GSschool', '6', '2', '男性', 'my', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 5, 15, 20, 10, 30, 100, '2025-07-04 00:54:26', NULL, NULL, NULL, NULL),
(19, '2025-05-12', 'チカオカ　レイ', 'GSschool', '6', '3', '男性', 'ja', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 5, 15, 20, 10, 30, 100, '2025-07-04 09:59:23', NULL, NULL, NULL, NULL),
(20, '2025-04-01', 'astte erwwd', 'ABC 小学校', '7', '3', '男性', 'tl', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 5, 15, 20, 10, 30, 100, '2025-07-05 07:05:57', NULL, NULL, NULL, NULL),
(21, '2025-04-08', 'ちかおか　あけみ', 'GS小学校', '6', '2', '女子', 'ja', 5, 0, 0, 0, 5, 0, 0, 10, 2, 2, 0, 0, 0, 0, 0, 2, 2, 2, 10, 0, 0, 0, 0, 4, 3, 7, 27, '2025-07-05 07:12:19', NULL, NULL, NULL, NULL),
(23, '2025-07-06', '金髪　専制', 'テスト学校', '1', 'B', '男', 'ja', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 5, 15, 20, 10, 30, 100, '2025-07-06 07:13:09', NULL, NULL, NULL, NULL),
(24, '2025-07-06', 'jajajaja kakakaka', 'GS小学校', '6', 'さくら', '男性', 'mn', 5, 5, 0, 0, 0, 5, 5, 20, 2, 2, 0, 0, 2, 2, 2, 2, 0, 0, 12, 5, 5, 5, 15, 7, 3, 10, 57, '2025-07-08 10:42:31', NULL, NULL, NULL, NULL),
(28, '2025-07-10', 'CEC CEC　 CEC', 'CEC CEC　 CEC', 'C', 'E', '男性', 'pt', 5, 5, 5, 5, 5, 0, 0, 25, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 8, 5, 5, 5, 15, 0, 0, 0, 48, '2025-07-08 23:56:36', 'う,ぬ,ん', '', '', ''),
(30, '2025-07-10', 'かかかか　とととと', 'OOO幼稚園', '年少', 'ひまわり', '男子', 'mn', 5, 5, 5, 0, 0, 0, 0, 15, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 8, 5, 5, 0, 10, 0, 0, 0, 33, '2025-07-09 11:21:44', 'あ,い,え,か,く,こ,さ,し,す,せ,そ,た,つ,て,と,な,に,ぬ,ね,の,は,ひ,ふ,へ,ほ,ま,み,む,め,も,や,ゆ,よ,ら,り,る,れ,ろ,わ,を', 'イ,ウ,エ,オ,カ,キ,ク,コ,サ,ス,セ,ソ,タ,チ,ツ,テ,ト,ナ,ニ,ヌ,ネ,ノ,ハ,ヒ,フ,ヘ,ホ,マ,ミ,ム,メ,モ,ヤ,ユ,ヨ,ラ,リ,ル,レ,ロ,ワ,ヲ', '', ''),
(31, '2025-07-09', 'ASDF GHJKL', 'QWERTYUI', 'i', 'o', '男性', 'ta', 5, 5, 0, 0, 5, 5, 5, 25, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 4, 5, 0, 0, 5, 4, 4, 8, 42, '2025-07-09 11:29:53', 'あ,い,え,か,く,け,こ,さ,し,す,せ,そ,た,ち,つ,て,と,な,に,ぬ,ね,の,は,ひ,ふ,へ,ほ,ま,み,む,め,も,や,ゆ,よ,ら,り,る,れ,ろ,わ,を', 'イ,ウ,エ,オ,カ,キ,ク,コ,サ,ス,セ,ソ,タ,チ,ツ,テ,ト,ナ,ニ,ヌ,ネ,ノ,ハ,ヒ,フ,ヘ,ホ,マ,ミ,ム,メ,モ,ヤ,ユ,ヨ,ラ,リ,ル,レ,ロ,ワ,ヲ', 'う,お,き,ん', 'ア,ケ,シ,ン'),
(32, '2025-07-11', 'GAGAGAGAGAGAGAGA', 'GSGSGSHS小学校', 'G', 'S', '男性', 'km', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 0, 10, 0, 0, 0, 65, '2025-07-09 11:33:33', '', '', '', ''),
(34, '2025-07-09', 'らららららら', 'ファファソソ', 'f', 'あ', '女性', 'my', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 5, 5, 0, 10, 0, 0, 0, 65, '2025-07-09 12:16:25', NULL, NULL, '', ''),
(35, '2025-07-10', 'BBBBBBBBBBBBBB', 'BBBBBBBBBBBBBB', 'B', 'B', '男子', 'ur', 5, 5, 5, 5, 0, 5, 5, 30, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 14, 5, 5, 0, 10, 0, 0, 0, 54, '2025-07-11 11:57:17', '', '', '', ''),
(39, '2025-07-11', 'WWWWWWWWWWW', 'WWWWWWWWWWWw', 'w', 'w', '女性', 'my', 5, 5, 5, 5, 5, 5, 0, 30, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 16, 5, 5, 5, 15, 5, 5, 10, 71, '2025-07-11 12:28:47', 'さ,そ,ち,て,ぬ,ね,は,ふ,み,む,め,や,よ,ら,れ', 'ア,ケ,ネ,ヒ,ヨ', 'う,お,き,け,ん', 'シ,チ,テ,ツ,ン'),
(40, '2025-07-15', 'YYYYYYYYYYYYYY', 'YYYYYYYYYY', 'Y', 'Y', 'Y', 'fa', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 2, 9, 9, '2025-07-16 07:00:21', 'わ,ら,や,ま,は,な,た,さ,か,あ,り,み,ひ,に,ち,し,い,る,ゆ,む,ふ,ぬ,つ,す,く,れ,め,へ,ね,せ,え,を,ろ,よ,も,ほ,の,と,こ', 'ワ,ラ,ヤ,マ,ハ,ナ,タ,サ,カ,リ,ミ,ヒ,ニ,チ,シ,キ,イ,ル,ユ,ム,フ,ヌ,ツ,ス,ク,ウ,レ,メ,ヘ,ネ,テ,セ,ケ,エ,ヲ,ロ,ヨ,モ,ホ,ノ,ト,ソ,コ,オ', 'ん,き,う,て,け,そ,お', 'ン,ア'),
(41, '2025-07-16', 'AAAAAAAAAAAAAAAAAA', 'DDDDschool', 'DS', 'DS', '女性', 'yue', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '2025-07-16 07:12:57', '', '', '', ''),
(42, '2025-07-16', 'kkkkkkkkkkkkkkkkkkkkkkk', 'kkkkk', 'k', 'k', 'k', 'id', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 1, 4, 4, '2025-07-16 10:09:55', 'わ,ら,や,ま,は,な,た,さ,か,あ,り,み,ひ,に,ち,し,き,い,る,ゆ,む,ふ,ぬ,つ,す,く,れ,め,へ,ね,て,せ,け,え,を,ろ,よ,も,ほ,の,と,そ,こ', 'ン,ワ,ラ,ヤ,マ,ハ,ナ,タ,サ,カ,リ,ミ,ヒ,ニ,チ,シ,キ,イ,ル,ユ,ム,フ,ヌ,ツ,ス,ク,ウ,レ,メ,ヘ,ネ,テ,セ,ケ,エ,ヲ,ロ,ヨ,モ,ホ,ノ,ト,ソ,コ,オ', 'ん,う,お', 'ア'),
(43, '2025-07-16', 'ooooooooooooooo', 'ooooooo', 'o', 'o', 'o', 'ne', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 16, 5, 5, 5, 15, 4, 3, 7, 73, '2025-07-16 11:20:32', 'う,さ,そ,ち,て,ぬ,ね,は,ふ,み,む,め,や,よ,ら,れ', 'チ,ツ,テ,ネ,ヒ,ヨ,ン', 'お,き,け,ん', 'ア,ケ,シ'),
(44, '2025-07-19', 'ZZZZZZZZZZZZ', 'ZZZZZZZZZZ', 'Z', 'Z', 'Z', 'ur', 5, 5, 5, 5, 5, 5, 5, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 18, 5, 5, 0, 10, 4, 4, 8, 71, '2025-07-19 01:33:40', 'け,さ,そ,ち,て,ぬ,ね,は,ふ,み,む,め,や,よ,ら,れ', 'チ,ツ,テ,ネ,ヒ,ヨ', 'う,お,き,ん', 'ア,ケ,シ,ン');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `gs_leveltest3_01`
--
ALTER TABLE `gs_leveltest3_01`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `gs_leveltest3_01`
--
ALTER TABLE `gs_leveltest3_01`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
